/*
* linux/fs/super.c
*
* (C) 1991 Linus Torvalds
*/

/*
* super.c contains code to handle the super-block tables.
*/
#include <linux/config.h>	// ÄÚºËÅäÖÃÍ·ÎÄ¼ş¡£¶¨Òå¼üÅÌÓïÑÔºÍÓ²ÅÌÀàĞÍ£¨HD_TYPE£©¿ÉÑ¡Ïî¡£
#include <linux/sched.h>	// µ÷¶È³ÌĞòÍ·ÎÄ¼ş£¬¶¨ÒåÁËÈÎÎñ½á¹¹task_struct¡¢³õÊ¼ÈÎÎñ0 µÄÊı¾İ£¬
// »¹ÓĞÒ»Ğ©ÓĞ¹ØÃèÊö·û²ÎÊıÉèÖÃºÍ»ñÈ¡µÄÇ¶ÈëÊ½»ã±àº¯ÊıºêÓï¾ä¡£
#include <linux/kernel.h>	// ÄÚºËÍ·ÎÄ¼ş¡£º¬ÓĞÒ»Ğ©ÄÚºË³£ÓÃº¯ÊıµÄÔ­ĞÎ¶¨Òå¡£
#include <asm/system.h>		// ÏµÍ³Í·ÎÄ¼ş¡£¶¨ÒåÁËÉèÖÃ»òĞŞ¸ÄÃèÊö·û/ÖĞ¶ÏÃÅµÈµÄÇ¶ÈëÊ½»ã±àºê¡£

#include <errno.h>		// ´íÎóºÅÍ·ÎÄ¼ş¡£°üº¬ÏµÍ³ÖĞ¸÷ÖÖ³ö´íºÅ¡£(Linus ´Óminix ÖĞÒı½øµÄ)¡£
#include <sys/stat.h>		// ÎÄ¼ş×´Ì¬Í·ÎÄ¼ş¡£º¬ÓĞÎÄ¼ş»òÎÄ¼şÏµÍ³×´Ì¬½á¹¹stat{}ºÍ³£Á¿¡£

int sync_dev (int dev);		// ¶ÔÖ¸¶¨Éè±¸Ö´ĞĞ¸ßËÙ»º³åÓëÉè±¸ÉÏÊı¾İµÄÍ¬²½²Ù×÷¡£(fs/buffer.c,59)
void wait_for_keypress (void);	// µÈ´ı»÷¼ü¡£(kernel/chr_drv/tty_io.c, 140)

/* set_bit uses setb, as gas doesn't recognize setc */
/* set_bit()Ê¹ÓÃÁËsetb Ö¸Áî£¬ÒòÎª»ã±à±àÒëÆ÷gas ²»ÄÜÊ¶±ğÖ¸Áîsetc */
//// ²âÊÔÖ¸¶¨Î»Æ«ÒÆ´¦±ÈÌØÎ»µÄÖµ(0 »ò1)£¬²¢·µ»Ø¸Ã±ÈÌØÎ»Öµ¡£(Ó¦¸ÃÈ¡ÃûÎªtest_bit()¸üÍ×Ìû)
mount_root
  ´ ÅÅÌi ½ Úµã½á¹¹±ØĞëÊÇ32 × Ö½Ú¶ÔÎÄ¼ş±í64 Ï
  î½øĞĞ³õÊ¼»¯Èç¹û¸ùÎÄ¼şÏµÍ³ÊÇÈíÅÌµÄ»°£¬¾ÍÌáÊ¾²åÈë¸ùÅÌ£¬²¢°´»Ø³µ¼ü³õÊ¼»¯³¬¼¶¿éÊı×é£¨¹²8
  Ï î£©¶ÁÈ¡¸ùÉè±¸ÉÏµÄ³¬¼¶¿éºÍ¸ùi ½ Úµã½á¹¹ĞÅÏ¢ÉèÖÃ¸ùi ½ ÚµãÒıÓÃ´ÎÊıÎª4 £
  ¬²¢×÷Îª½ø³Ì1 µ Äµ±Ç°¹¤×÷Ä¿Â¼ºÍ¸ùÄ¿Â¼µÄi ½
  Úµã¡£¸ù¾İÂß¼­¿éÎ»Í¼Í³¼Æ¿ÕÏĞÅÌ¿éÊı²¢ÏÔÊ¾¸ù¾İi ½ ÚµãÎ»Í¼Í³¼Æ¿ÕÏĞi ½
  ÚµãÊı²¢ÏÔÊ¾·µ»Ø
// Ç¶ÈëÊ½»ã±àºê¡£²ÎÊıbitnr ÊÇ±ÈÌØÎ»Æ«ÒÆÖµ£¬addr ÊÇ²âÊÔ±ÈÌØÎ»²Ù×÷µÄÆğÊ¼µØÖ·¡£
// %0 - ax(__res)£¬%1 - 0£¬%2 - bitnr£¬%3 - addr
#define set_bit(bitnr,addr) ({ \
register int __res __asm__( "ax"); \
__asm__( "bt %2,%3;setb %%al": "=a" (__res): "a" (0), "r" (bitnr), "m" (*(addr))); \
__res; })
struct super_block super_block[NR_SUPER];	// ³¬¼¶¿é½á¹¹Êı×é£¨¹²8 Ïî£©¡£
/* this is initialized in init/main.c */
/* ROOT_DEV ÒÑÔÚinit/main.c ÖĞ±»³õÊ¼»¯ */
int ROOT_DEV = 0;

//// Ëø¶¨Ö¸¶¨µÄ³¬¼¶¿é¡£
static void
lock_super (struct super_block *sb)
{
  cli ();			// ¹ØÖĞ¶Ï¡£
  while (sb->s_lock)		// Èç¹û¸Ã³¬¼¶¿éÒÑ¾­ÉÏËø£¬ÔòË¯ÃßµÈ´ı¡£
    sleep_on (&(sb->s_wait));
  sb->s_lock = 1;		// ¸ø¸Ã³¬¼¶¿é¼ÓËø£¨ÖÃËø¶¨±êÖ¾£©¡£
  sti ();			// ¿ªÖĞ¶Ï¡£
}

//// ¶ÔÖ¸¶¨³¬¼¶¿é½âËø¡££¨Èç¹ûÊ¹ÓÃulock_super Õâ¸öÃû³ÆÔò¸üÍ×Ìû£©¡£
static void
free_super (struct super_block *sb)
{
  cli ();			// ¹ØÖĞ¶Ï¡£
  sb->s_lock = 0;		// ¸´Î»Ëø¶¨±êÖ¾¡£
  wake_up (&(sb->s_wait));	// »½ĞÑµÈ´ı¸Ã³¬¼¶¿éµÄ½ø³Ì¡£
  sti ();			// ¿ªÖĞ¶Ï¡£
}

//// Ë¯ÃßµÈ´ı³¬¼¶¿é½âËø¡£
static void
wait_on_super (struct super_block *sb)
{
  cli ();			// ¹ØÖĞ¶Ï¡£
  while (sb->s_lock)		// Èç¹û³¬¼¶¿éÒÑ¾­ÉÏËø£¬ÔòË¯ÃßµÈ´ı¡£
    sleep_on (&(sb->s_wait));
  sti ();			// ¿ªÖĞ¶Ï¡£
}

//// È¡Ö¸¶¨Éè±¸µÄ³¬¼¶¿é¡£·µ»Ø¸Ã³¬¼¶¿é½á¹¹Ö¸Õë¡£
struct super_block *
get_super (int dev)
{
  struct super_block *s;

// Èç¹ûÃ»ÓĞÖ¸¶¨Éè±¸£¬Ôò·µ»Ø¿ÕÖ¸Õë¡£
  if (!dev)
    return NULL;
// s Ö¸Ïò³¬¼¶¿éÊı×é¿ªÊ¼´¦¡£ËÑË÷Õû¸ö³¬¼¶¿éÊı×é£¬Ñ°ÕÒÖ¸¶¨Éè±¸µÄ³¬¼¶¿é¡£
  s = 0 + super_block;
  while (s < NR_SUPER + super_block)
// Èç¹ûµ±Ç°ËÑË÷ÏîÊÇÖ¸¶¨Éè±¸µÄ³¬¼¶¿é£¬ÔòÊ×ÏÈµÈ´ı¸Ã³¬¼¶¿é½âËø£¨ÈôÒÑ¾­±»ÆäËü½ø³ÌÉÏËøµÄ»°£©¡£
// ÔÚµÈ´ıÆÚ¼ä£¬¸Ã³¬¼¶¿éÓĞ¿ÉÄÜ±»ÆäËüÉè±¸Ê¹ÓÃ£¬Òò´Ë´ËÊ±ĞèÔÙÅĞ¶ÏÒ»´ÎÊÇ·ñÊÇÖ¸¶¨Éè±¸µÄ³¬¼¶¿é£¬
// Èç¹ûÊÇÔò·µ»Ø¸Ã³¬¼¶¿éµÄÖ¸Õë¡£·ñÔò¾ÍÖØĞÂ¶Ô³¬¼¶¿éÊı×éÔÙËÑË÷Ò»±é£¬Òò´Ës ÖØÓÖÖ¸Ïò³¬¼¶¿éÊı×é
// ¿ªÊ¼´¦¡£
    if (s->s_dev == dev)
      {
	wait_on_super (s);
	if (s->s_dev == dev)
	  return s;
	s = 0 + super_block;
// Èç¹ûµ±Ç°ËÑË÷Ïî²»ÊÇ£¬Ôò¼ì²éÏÂÒ»Ïî¡£Èç¹ûÃ»ÓĞÕÒµ½Ö¸¶¨µÄ³¬¼¶¿é£¬Ôò·µ»Ø¿ÕÖ¸Õë¡£
      }
    else
      s++;
  return NULL;
}

//// ÊÍ·ÅÖ¸¶¨Éè±¸µÄ³¬¼¶¿é¡£
// ÊÍ·ÅÉè±¸ËùÊ¹ÓÃµÄ³¬¼¶¿éÊı×éÏî£¨ÖÃs_dev=0£©£¬²¢ÊÍ·Å¸ÃÉè±¸i ½ÚµãÎ»Í¼ºÍÂß¼­¿éÎ»Í¼ËùÕ¼ÓÃ
// µÄ¸ßËÙ»º³å¿é¡£Èç¹û³¬¼¶¿é¶ÔÓ¦µÄÎÄ¼şÏµÍ³ÊÇ¸ùÎÄ¼şÏµÍ³£¬»òÕßÆäi ½ÚµãÉÏÒÑ¾­°²×°ÓĞÆäËüµÄÎÄ¼ş
// ÏµÍ³£¬Ôò²»ÄÜÊÍ·Å¸Ã³¬¼¶¿é¡£
void
put_super (int dev)
{
  struct super_block *sb;
  struct m_inode *inode;
  int i;

// Èç¹ûÖ¸¶¨Éè±¸ÊÇ¸ùÎÄ¼şÏµÍ³Éè±¸£¬ÔòÏÔÊ¾¾¯¸æĞÅÏ¢¡°¸ùÏµÍ³ÅÌ¸Ä±äÁË£¬×¼±¸ÉúËÀ¾öÕ½°É¡±£¬²¢·µ»Ø¡£
  if (dev == ROOT_DEV)
    {
      printk ("root diskette changed: prepare for armageddon\n\r");
      return;
    }
// Èç¹ûÕÒ²»µ½Ö¸¶¨Éè±¸µÄ³¬¼¶¿é£¬Ôò·µ»Ø¡£
  if (!(sb = get_super (dev)))
    return;
// Èç¹û¸Ã³¬¼¶¿éÖ¸Ã÷±¾ÎÄ¼şÏµÍ³i ½ÚµãÉÏ°²×°ÓĞÆäËüµÄÎÄ¼şÏµÍ³£¬ÔòÏÔÊ¾¾¯¸æĞÅÏ¢£¬·µ»Ø¡£
  if (sb->s_imount)
    {
      printk ("Mounted disk changed - tssk, tssk\n\r");
      return;
    }
// ÕÒµ½Ö¸¶¨Éè±¸µÄ³¬¼¶¿éºó£¬Ê×ÏÈËø¶¨¸Ã³¬¼¶¿é£¬È»ºóÖÃ¸Ã³¬¼¶¿é¶ÔÓ¦µÄÉè±¸ºÅ×Ö¶ÎÎª0£¬Ò²¼´¼´½«
// ·ÅÆú¸Ã³¬¼¶¿é¡£
  lock_super (sb);
  sb->s_dev = 0;
// È»ºóÊÍ·Å¸ÃÉè±¸i ½ÚµãÎ»Í¼ºÍÂß¼­¿éÎ»Í¼ÔÚ»º³åÇøÖĞËùÕ¼ÓÃµÄ»º³å¿é¡£
  for (i = 0; i < I_MAP_SLOTS; i++)
    brelse (sb->s_imap[i]);
  for (i = 0; i < Z_MAP_SLOTS; i++)
    brelse (sb->s_zmap[i]);
// ×îºó¶Ô¸Ã³¬¼¶¿é½âËø£¬²¢·µ»Ø¡£
  free_super (sb);
  return;
}

//// ´ÓÉè±¸ÉÏ¶ÁÈ¡³¬¼¶¿éµ½»º³åÇøÖĞ¡£
// Èç¹û¸ÃÉè±¸µÄ³¬¼¶¿éÒÑ¾­ÔÚ¸ßËÙ»º³åÖĞ²¢ÇÒÓĞĞ§£¬ÔòÖ±½Ó·µ»Ø¸Ã³¬¼¶¿éµÄÖ¸Õë¡£
static struct super_block *
read_super (int dev)
{
  struct super_block *s;
  struct buffer_head *bh;
  int i, block;

// Èç¹ûÃ»ÓĞÖ¸Ã÷Éè±¸£¬Ôò·µ»Ø¿ÕÖ¸Õë¡£
  if (!dev)
    return NULL;
// Ê×ÏÈ¼ì²é¸ÃÉè±¸ÊÇ·ñ¿É¸ü»»¹ıÅÌÆ¬£¨Ò²¼´ÊÇ·ñÊÇÈíÅÌÉè±¸£©£¬Èç¹û¸ü»»¹ıÅÌ£¬Ôò¸ßËÙ»º³åÇøÓĞ¹Ø¸Ã
// Éè±¸µÄËùÓĞ»º³å¿é¾ùÊ§Ğ§£¬ĞèÒª½øĞĞÊ§Ğ§´¦Àí£¨ÊÍ·ÅÔ­À´¼ÓÔØµÄÎÄ¼şÏµÍ³£©¡£
  check_disk_change (dev);
// Èç¹û¸ÃÉè±¸µÄ³¬¼¶¿éÒÑ¾­ÔÚ¸ßËÙ»º³åÖĞ£¬ÔòÖ±½Ó·µ»Ø¸Ã³¬¼¶¿éµÄÖ¸Õë¡£
  if (s = get_super (dev))
    return s;
// ·ñÔò£¬Ê×ÏÈÔÚ³¬¼¶¿éÊı×éÖĞÕÒ³öÒ»¸ö¿ÕÏî(Ò²¼´Æäs_dev=0 µÄÏî)¡£Èç¹ûÊı×éÒÑ¾­Õ¼ÂúÔò·µ»Ø¿ÕÖ¸Õë¡£
  for (s = 0 + super_block;; s++)
    {
      if (s >= NR_SUPER + super_block)
	return NULL;
      if (!s->s_dev)
	break;
    }
// ÕÒµ½³¬¼¶¿é¿ÕÏîºó£¬¾Í½«¸Ã³¬¼¶¿éÓÃÓÚÖ¸¶¨Éè±¸£¬¶Ô¸Ã³¬¼¶¿éµÄÄÚ´æÏî½øĞĞ²¿·Ö³õÊ¼»¯¡£
  s->s_dev = dev;
  s->s_isup = NULL;
  s->s_imount = NULL;
  s->s_time = 0;
  s->s_rd_only = 0;
  s->s_dirt = 0;
// È»ºóËø¶¨¸Ã³¬¼¶¿é£¬²¢´ÓÉè±¸ÉÏ¶ÁÈ¡³¬¼¶¿éĞÅÏ¢µ½bh Ö¸ÏòµÄ»º³åÇøÖĞ¡£Èç¹û¶Á³¬¼¶¿é²Ù×÷Ê§°Ü£¬
// ÔòÊÍ·ÅÉÏÃæÑ¡¶¨µÄ³¬¼¶¿éÊı×éÖĞµÄÏî£¬²¢½âËø¸ÃÏî£¬·µ»Ø¿ÕÖ¸ÕëÍË³ö¡£
  lock_super (s);
  if (!(bh = bread (dev, 1)))
    {
      s->s_dev = 0;
      free_super (s);
      return NULL;
    }
// ½«Éè±¸ÉÏ¶ÁÈ¡µÄ³¬¼¶¿éĞÅÏ¢¸´ÖÆµ½³¬¼¶¿éÊı×éÏàÓ¦Ïî½á¹¹ÖĞ¡£²¢ÊÍ·Å´æ·Å¶ÁÈ¡ĞÅÏ¢µÄ¸ßËÙ»º³å¿é¡£
  *((struct d_super_block *) s) = *((struct d_super_block *) bh->b_data);
  brelse (bh);
// Èç¹û¶ÁÈ¡µÄ³¬¼¶¿éµÄÎÄ¼şÏµÍ³Ä§Êı×Ö¶ÎÄÚÈİ²»¶Ô£¬ËµÃ÷Éè±¸ÉÏ²»ÊÇÕıÈ·µÄÎÄ¼şÏµÍ³£¬Òò´ËÍ¬ÉÏÃæ
// Ò»Ñù£¬ÊÍ·ÅÉÏÃæÑ¡¶¨µÄ³¬¼¶¿éÊı×éÖĞµÄÏî£¬²¢½âËø¸ÃÏî£¬·µ»Ø¿ÕÖ¸ÕëÍË³ö¡£
// ¶ÔÓÚ¸Ã°ælinux ÄÚºË£¬Ö»Ö§³Öminix ÎÄ¼şÏµÍ³°æ±¾1.0£¬ÆäÄ§ÊıÊÇ0x137f¡£
  if (s->s_magic != SUPER_MAGIC)
    {
      s->s_dev = 0;
      free_super (s);
      return NULL;
    }
// ÏÂÃæ¿ªÊ¼¶ÁÈ¡Éè±¸ÉÏi ½ÚµãÎ»Í¼ºÍÂß¼­¿éÎ»Í¼Êı¾İ¡£Ê×ÏÈ³õÊ¼»¯ÄÚ´æ³¬¼¶¿é½á¹¹ÖĞÎ»Í¼¿Õ¼ä¡£
  for (i = 0; i < I_MAP_SLOTS; i++)
    s->s_imap[i] = NULL;
  for (i = 0; i < Z_MAP_SLOTS; i++)
    s->s_zmap[i] = NULL;
// È»ºó´ÓÉè±¸ÉÏ¶ÁÈ¡i ½ÚµãÎ»Í¼ºÍÂß¼­¿éÎ»Í¼ĞÅÏ¢£¬²¢´æ·ÅÔÚ³¬¼¶¿é¶ÔÓ¦×Ö¶ÎÖĞ¡£
  block = 2;
  for (i = 0; i < s->s_imap_blocks; i++)
    if (s->s_imap[i] = bread (dev, block))
      block++;
    else
      break;
  for (i = 0; i < s->s_zmap_blocks; i++)
    if (s->s_zmap[i] = bread (dev, block))
      block++;
    else
      break;
// Èç¹û¶Á³öµÄÎ»Í¼Âß¼­¿éÊı²»µÈÓÚÎ»Í¼Ó¦¸ÃÕ¼ÓĞµÄÂß¼­¿éÊı£¬ËµÃ÷ÎÄ¼şÏµÍ³Î»Í¼ĞÅÏ¢ÓĞÎÊÌâ£¬³¬¼¶¿é
// ³õÊ¼»¯Ê§°Ü¡£Òò´ËÖ»ÄÜÊÍ·ÅÇ°ÃæÉêÇëµÄËùÓĞ×ÊÔ´£¬·µ»Ø¿ÕÖ¸Õë²¢ÍË³ö¡£
  if (block != 2 + s->s_imap_blocks + s->s_zmap_blocks)
    {
// ÊÍ·Åi ½ÚµãÎ»Í¼ºÍÂß¼­¿éÎ»Í¼Õ¼ÓÃµÄ¸ßËÙ»º³åÇø¡£
      for (i = 0; i < I_MAP_SLOTS; i++)
	brelse (s->s_imap[i]);
      for (i = 0; i < Z_MAP_SLOTS; i++)
	brelse (s->s_zmap[i]);
//ÊÍ·ÅÉÏÃæÑ¡¶¨µÄ³¬¼¶¿éÊı×éÖĞµÄÏî£¬²¢½âËø¸Ã³¬¼¶¿éÏî£¬·µ»Ø¿ÕÖ¸ÕëÍË³ö¡£
      s->s_dev = 0;
      free_super (s);
      return NULL;
    }
// ·ñÔòÒ»ÇĞ³É¹¦¡£¶ÔÓÚÉêÇë¿ÕÏĞi ½ÚµãµÄº¯ÊıÀ´½²£¬Èç¹ûÉè±¸ÉÏËùÓĞµÄi ½ÚµãÒÑ¾­È«±»Ê¹ÓÃ£¬Ôò²éÕÒ
// º¯Êı»á·µ»Ø0 Öµ¡£Òò´Ë0 ºÅi ½ÚµãÊÇ²»ÄÜÓÃµÄ£¬ËùÒÔÕâÀï½«Î»Í¼ÖĞµÄ×îµÍÎ»ÉèÖÃÎª1£¬ÒÔ·ÀÖ¹ÎÄ¼ş
// ÏµÍ³·ÖÅä0 ºÅi ½Úµã¡£Í¬ÑùµÄµÀÀí£¬Ò²½«Âß¼­¿éÎ»Í¼µÄ×îµÍÎ»ÉèÖÃÎª1¡£
  s->s_imap[0]->b_data[0] |= 1;
  s->s_zmap[0]->b_data[0] |= 1;
// ½âËø¸Ã³¬¼¶¿é£¬²¢·µ»Ø³¬¼¶¿éÖ¸Õë¡£
  free_super (s);
  return s;
}

//// Ğ¶ÔØÎÄ¼şÏµÍ³µÄÏµÍ³µ÷ÓÃº¯Êı¡£
// ²ÎÊıdev_name ÊÇÉè±¸ÎÄ¼şÃû¡£
int
sys_umount (char *dev_name)
{
  struct m_inode *inode;
  struct super_block *sb;
  int dev;

// Ê×ÏÈ¸ù¾İÉè±¸ÎÄ¼şÃûÕÒµ½¶ÔÓ¦µÄi ½Úµã£¬²¢È¡ÆäÖĞµÄÉè±¸ºÅ¡£
  if (!(inode = namei (dev_name)))
    return -ENOENT;
  dev = inode->i_zone[0];
// Èç¹û²»ÊÇ¿éÉè±¸ÎÄ¼ş£¬ÔòÊÍ·Å¸ÕÉêÇëµÄi ½Úµãdev_i£¬·µ»Ø³ö´íÂë¡£
  if (!S_ISBLK (inode->i_mode))
    {
      iput (inode);
      return -ENOTBLK;
    }
// ÊÍ·ÅÉè±¸ÎÄ¼şÃûµÄi ½Úµã¡£
  iput (inode);
// Èç¹ûÉè±¸ÊÇ¸ùÎÄ¼şÏµÍ³£¬Ôò²»ÄÜ±»Ğ¶ÔØ£¬·µ»Ø³ö´íºÅ¡£
  if (dev == ROOT_DEV)
    return -EBUSY;
// Èç¹ûÈ¡Éè±¸µÄ³¬¼¶¿éÊ§°Ü£¬»òÕß¸ÃÉè±¸ÎÄ¼şÏµÍ³Ã»ÓĞ°²×°¹ı£¬Ôò·µ»Ø³ö´íÂë¡£
  if (!(sb = get_super (dev)) || !(sb->s_imount))
    return -ENOENT;
// Èç¹û³¬¼¶¿éËùÖ¸Ã÷µÄ±»°²×°µ½µÄi ½ÚµãÃ»ÓĞÖÃÎ»Æä°²×°±êÖ¾£¬ÔòÏÔÊ¾¾¯¸æĞÅÏ¢¡£
  if (!sb->s_imount->i_mount)
    printk ("Mounted inode has i_mount=0\n");
// ²éÕÒi ½Úµã±í£¬¿´ÊÇ·ñÓĞ½ø³ÌÔÚÊ¹ÓÃ¸ÃÉè±¸ÉÏµÄÎÄ¼ş£¬Èç¹ûÓĞÔò·µ»ØÃ¦³ö´íÂë¡£
  for (inode = inode_table + 0; inode < inode_table + NR_INODE; inode++)
    if (inode->i_dev == dev && inode->i_count)
      return -EBUSY;
// ¸´Î»±»°²×°µ½µÄi ½ÚµãµÄ°²×°±êÖ¾£¬ÊÍ·Å¸Ãi ½Úµã¡£
  sb->s_imount->i_mount = 0;
  iput (sb->s_imount);
// ÖÃ³¬¼¶¿éÖĞ±»°²×°i ½Úµã×Ö¶ÎÎª¿Õ£¬²¢ÊÍ·ÅÉè±¸ÎÄ¼şÏµÍ³µÄ¸ùi ½Úµã£¬ÖÃ³¬¼¶¿éÖĞ±»°²×°ÏµÍ³
// ¸ùi ½ÚµãÖ¸ÕëÎª¿Õ¡£
  sb->s_imount = NULL;
  iput (sb->s_isup);
  sb->s_isup = NULL;
// ÊÍ·Å¸ÃÉè±¸µÄ³¬¼¶¿éÒÔ¼°Î»Í¼Õ¼ÓÃµÄ»º³å¿é£¬²¢¶Ô¸ÃÉè±¸Ö´ĞĞ¸ßËÙ»º³åÓëÉè±¸ÉÏÊı¾İµÄÍ¬²½²Ù×÷¡£
  put_super (dev);
  sync_dev (dev);
  return 0;
}

//// °²×°ÎÄ¼şÏµÍ³µ÷ÓÃº¯Êı¡£
// ²ÎÊıdev_name ÊÇÉè±¸ÎÄ¼şÃû£¬dir_name ÊÇ°²×°µ½µÄÄ¿Â¼Ãû£¬rw_flag ±»°²×°ÎÄ¼şµÄ¶ÁĞ´±êÖ¾¡£
// ½«±»¼ÓÔØµÄµØ·½±ØĞëÊÇÒ»¸öÄ¿Â¼Ãû£¬²¢ÇÒ¶ÔÓ¦µÄi ½ÚµãÃ»ÓĞ±»ÆäËü³ÌĞòÕ¼ÓÃ¡£
int
sys_mount (char *dev_name, char *dir_name, int rw_flag)
{
  struct m_inode *dev_i, *dir_i;
  struct super_block *sb;
  int dev;

// Ê×ÏÈ¸ù¾İÉè±¸ÎÄ¼şÃûÕÒµ½¶ÔÓ¦µÄi ½Úµã£¬²¢È¡ÆäÖĞµÄÉè±¸ºÅ¡£
// ¶ÔÓÚ¿éÌØÊâÉè±¸ÎÄ¼ş£¬Éè±¸ºÅÔÚi ½ÚµãµÄi_zone[0]ÖĞ¡£
  if (!(dev_i = namei (dev_name)))
    return -ENOENT;
  dev = dev_i->i_zone[0];
// Èç¹û²»ÊÇ¿éÉè±¸ÎÄ¼ş£¬ÔòÊÍ·Å¸ÕÈ¡µÃµÄi ½Úµãdev_i£¬·µ»Ø³ö´íÂë¡£
  if (!S_ISBLK (dev_i->i_mode))
    {
      iput (dev_i);
      return -EPERM;
    }
// ÊÍ·Å¸ÃÉè±¸ÎÄ¼şµÄi ½Úµãdev_i¡£
  iput (dev_i);
// ¸ù¾İ¸ø¶¨µÄÄ¿Â¼ÎÄ¼şÃûÕÒµ½¶ÔÓ¦µÄi ½Úµãdir_i¡£
  if (!(dir_i = namei (dir_name)))
    return -ENOENT;
// Èç¹û¸Ãi ½ÚµãµÄÒıÓÃ¼ÆÊı²»Îª1£¨½öÔÚÕâÀïÒıÓÃ£©£¬»òÕß¸Ãi ½ÚµãµÄ½ÚµãºÅÊÇ¸ùÎÄ¼şÏµÍ³µÄ½Úµã
// ºÅ1£¬ÔòÊÍ·Å¸Ãi ½Úµã£¬·µ»Ø³ö´íÂë¡£
  if (dir_i->i_count != 1 || dir_i->i_num == ROOT_INO)
    {
      iput (dir_i);
      return -EBUSY;
    }
// Èç¹û¸Ã½Úµã²»ÊÇÒ»¸öÄ¿Â¼ÎÄ¼ş½Úµã£¬ÔòÒ²ÊÍ·Å¸Ãi ½Úµã£¬·µ»Ø³ö´íÂë¡£
  if (!S_ISDIR (dir_i->i_mode))
    {
      iput (dir_i);
      return -EPERM;
    }
// ¶ÁÈ¡½«°²×°ÎÄ¼şÏµÍ³µÄ³¬¼¶¿é£¬Èç¹ûÊ§°ÜÔòÒ²ÊÍ·Å¸Ãi ½Úµã£¬·µ»Ø³ö´íÂë¡£
  if (!(sb = read_super (dev)))
    {
      iput (dir_i);
      return -EBUSY;
    }
// Èç¹û½«Òª±»°²×°µÄÎÄ¼şÏµÍ³ÒÑ¾­°²×°ÔÚÆäËüµØ·½£¬ÔòÊÍ·Å¸Ãi ½Úµã£¬·µ»Ø³ö´íÂë¡£
  if (sb->s_imount)
    {
      iput (dir_i);
      return -EBUSY;
    }
// Èç¹û½«Òª°²×°µ½µÄi ½ÚµãÒÑ¾­°²×°ÁËÎÄ¼şÏµÍ³(°²×°±êÖ¾ÒÑ¾­ÖÃÎ»)£¬ÔòÊÍ·Å¸Ãi ½Úµã£¬·µ»Ø³ö´íÂë¡£
  if (dir_i->i_mount)
    {
      iput (dir_i);
      return -EPERM;
    }
// ±»°²×°ÎÄ¼şÏµÍ³³¬¼¶¿éµÄ¡°±»°²×°µ½i ½Úµã¡±×Ö¶ÎÖ¸Ïò°²×°µ½µÄÄ¿Â¼ÃûµÄi ½Úµã¡£
  sb->s_imount = dir_i;
// ÉèÖÃ°²×°Î»ÖÃi ½ÚµãµÄ°²×°±êÖ¾ºÍ½ÚµãÒÑĞŞ¸Ä±êÖ¾¡£/* ×¢Òâ£¡ÕâÀïÃ»ÓĞiput(dir_i) */
  dir_i->i_mount = 1;		/* Õâ½«ÔÚumount ÄÚ²Ù×÷ */
  dir_i->i_dirt = 1;		/* NOTE! we don't iput(dir_i) */
  return 0;			/* we do that in umount */
}

//// °²×°¸ùÎÄ¼şÏµÍ³¡£
// ¸Ãº¯ÊıÊÇÔÚÏµÍ³¿ª»ú³õÊ¼»¯ÉèÖÃÊ±(sys_setup())µ÷ÓÃµÄ¡£( kernel/blk_drv/hd.c, 157 )
void
mount_root (void)
{
  int i, free;
  struct super_block *p;
  struct m_inode *mi;

// Èç¹û´ÅÅÌi ½Úµã½á¹¹²»ÊÇ32 ¸ö×Ö½Ú£¬Ôò³ö´í£¬ËÀ»ú¡£¸ÃÅĞ¶ÏÊÇÓÃÓÚ·ÀÖ¹ĞŞ¸ÄÔ´´úÂëÊ±µÄ²»Ò»ÖÂĞÔ¡£
  if (32 != sizeof (struct d_inode))
    panic ("bad i-node size");
// ³õÊ¼»¯ÎÄ¼ş±íÊı×é£¨¹²64 Ïî£¬Ò²¼´ÏµÍ³Í¬Ê±Ö»ÄÜ´ò¿ª64 ¸öÎÄ¼ş£©£¬½«ËùÓĞÎÄ¼ş½á¹¹ÖĞµÄÒıÓÃ¼ÆÊı
// ÉèÖÃÎª0¡£[??ÎªÊ²Ã´·ÅÔÚÕâÀï³õÊ¼»¯£¿]
  for (i = 0; i < NR_FILE; i++)
    file_table[i].f_count = 0;
// Èç¹û¸ùÎÄ¼şÏµÍ³ËùÔÚÉè±¸ÊÇÈíÅÌµÄ»°£¬¾ÍÌáÊ¾¡°²åÈë¸ùÎÄ¼şÏµÍ³ÅÌ£¬²¢°´»Ø³µ¼ü¡±£¬²¢µÈ´ı°´¼ü¡£
  if (MAJOR (ROOT_DEV) == 2)
    {
      printk ("Insert root floppy and press ENTER");
      wait_for_keypress ();
    }
// ³õÊ¼»¯³¬¼¶¿éÊı×é£¨¹²8 Ïî£©¡£
  for (p = &super_block[0]; p < &super_block[NR_SUPER]; p++)
    {
      p->s_dev = 0;
      p->s_lock = 0;
      p->s_wait = NULL;
    }
// Èç¹û¶Á¸ùÉè±¸ÉÏ³¬¼¶¿éÊ§°Ü£¬ÔòÏÔÊ¾ĞÅÏ¢£¬²¢ËÀ»ú¡£
  if (!(p = read_super (ROOT_DEV)))
    panic ("Unable to mount root");
//´ÓÉè±¸ÉÏ¶ÁÈ¡ÎÄ¼şÏµÍ³µÄ¸ùi ½Úµã(1)£¬Èç¹ûÊ§°ÜÔòÏÔÊ¾³ö´íĞÅÏ¢£¬ËÀ»ú¡£
  if (!(mi = iget (ROOT_DEV, ROOT_INO)))
    panic ("Unable to read root i-node");
// ¸Ãi ½ÚµãÒıÓÃ´ÎÊıµİÔö3 ´Î¡£ÒòÎªÏÂÃæ266-268 ĞĞÉÏÒ²ÒıÓÃÁË¸Ãi ½Úµã¡£
  mi->i_count += 3;		/* NOTE! it is logically used 4 times, not 1 */
/* ×¢Òâ£¡´ÓÂß¼­ÉÏ½²£¬ËüÒÑ±»ÒıÓÃÁË4 ´Î£¬¶ø²»ÊÇ1 ´Î */
// ÖÃ¸Ã³¬¼¶¿éµÄ±»°²×°ÎÄ¼şÏµÍ³i ½ÚµãºÍ±»°²×°µ½µÄi ½ÚµãÎª¸Ãi ½Úµã¡£
  p->s_isup = p->s_imount = mi;
// ÉèÖÃµ±Ç°½ø³ÌµÄµ±Ç°¹¤×÷Ä¿Â¼ºÍ¸ùÄ¿Â¼i ½Úµã¡£´ËÊ±µ±Ç°½ø³ÌÊÇ1 ºÅ½ø³Ì¡£
  current->pwd = mi;
  current->root = mi;
// Í³¼Æ¸ÃÉè±¸ÉÏ¿ÕÏĞ¿éÊı¡£Ê×ÏÈÁîi µÈÓÚ³¬¼¶¿éÖĞ±íÃ÷µÄÉè±¸Âß¼­¿é×ÜÊı¡£
  free = 0;
  i = p->s_nzones;
// È»ºó¸ù¾İÂß¼­¿éÎ»Í¼ÖĞÏàÓ¦±ÈÌØÎ»µÄÕ¼ÓÃÇé¿öÍ³¼Æ³ö¿ÕÏĞ¿éÊı¡£ÕâÀïºêº¯Êıset_bit()Ö»ÊÇÔÚ²âÊÔ
// ±ÈÌØÎ»£¬¶ø·ÇÉèÖÃ±ÈÌØÎ»¡£"i&8191"ÓÃÓÚÈ¡µÃi ½ÚµãºÅÔÚµ±Ç°¿éÖĞµÄÆ«ÒÆÖµ¡£"i>>13"ÊÇ½«i ³ıÒÔ
// 8192£¬Ò²¼´³ıÒ»¸ö´ÅÅÌ¿é°üº¬µÄ±ÈÌØÎ»Êı¡£
  while (--i >= 0)
    if (!set_bit (i & 8191, p->s_zmap[i >> 13]->b_data))
      free++;
// ÏÔÊ¾Éè±¸ÉÏ¿ÕÏĞÂß¼­¿éÊı/Âß¼­¿é×ÜÊı¡£
  printk ("%d/%d free blocks\n\r", free, p->s_nzones);
// Í³¼ÆÉè±¸ÉÏ¿ÕÏĞi ½ÚµãÊı¡£Ê×ÏÈÁîi µÈÓÚ³¬¼¶¿éÖĞ±íÃ÷µÄÉè±¸ÉÏi ½Úµã×ÜÊı+1¡£¼Ó1 ÊÇ½«0 ½Úµã
// Ò²Í³¼Æ½øÈ¥¡£
  free = 0;
  i = p->s_ninodes + 1;
// È»ºó¸ù¾İi ½ÚµãÎ»Í¼ÖĞÏàÓ¦±ÈÌØÎ»µÄÕ¼ÓÃÇé¿ö¼ÆËã³ö¿ÕÏĞi ½ÚµãÊı¡£
  while (--i >= 0)
    if (!set_bit (i & 8191, p->s_imap[i >> 13]->b_data))
      free++;
// ÏÔÊ¾Éè±¸ÉÏ¿ÉÓÃµÄ¿ÕÏĞi ½ÚµãÊı/i ½Úµã×ÜÊı¡£
  printk ("%d/%d free inodes\n\r", free, p->s_ninodes);
}
